Конфигурация/Documents/СделкаСВалютой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СделкаСВалютой</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>InformationRegister.УсловияСделокСВалютой</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПоСделке</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСделокСВалютой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСВалютой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрвалюты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрвалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКонтрвалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Плановая дата списания/зачисления денег</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложеннаяОплатаКомиссии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодтверждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ТипыСделокСВалютой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыСделокСВалютой</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Конверсионная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвопПерваяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвопВтораяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФорвардПоставочный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/СделкаСВалютой/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Для прямых конверсионных сделок нужно проверять номер подтверждения. Проверка должна работать для сделок с даты установки в рабочую
	Если Объект.Дата >= '20191225' 
		И ПустаяСтрока(Объект.НомерПодтверждения)
		И ЭтоПрямаяКонверсионнаяСделкаПИФ(Объект.СчетДоверительногоУправления, ЭтаФорма.СделкаЧерезБрокера, Объект.ТипСделки) Тогда
		 	                                                                                                                    		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан номер подтверждения",,,, Отказ);
		
	КонецЕсли;
	
	Если Объект.МестоХранения <> ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок")
		И ПустаяСтрока(Объект.НомерСделки) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан номер сделки",,,, Отказ);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьПодтверждениеОперацииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.СделкаЧерезБрокера = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("Брокер");
	КонецЕсли;
	
	Если ЭтаФорма.ДетализацияПоРасчетномуСчету Тогда
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчет");
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчетКонтрвалюты");
	КонецЕсли;
	
	Если ВариантыОплатыКомиссииБезДаты = 2 Тогда
		ПроверяемыеРеквизиты.Добавить("СуммаКомиссии");
		ПроверяемыеРеквизиты.Добавить("ВалютаКомиссии");
	ИначеЕсли ВариантОплатыКомиссииСДатой = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("СуммаКомиссии");
		ПроверяемыеРеквизиты.Добавить("ВалютаКомиссии");
		ПроверяемыеРеквизиты.Добавить("ДатаОплатыКомиссии");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	Иначе		
		РаботаСДокументамиКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ВариантыОплатыКомиссииБезДатыПриИзменении(Элемент)
	
	ЭтаФорма.ВариантОплатыКомиссииСДатой = 0;
	
	Объект.ОтложеннаяОплатаКомиссии = Ложь;
	Объект.ДатаОплатыКомиссии       = Неопределено;
		
	Если ЭтаФорма.ВариантыОплатыКомиссииБезДаты = 1 Тогда // отсутствует
		Объект.ВалютаКомиссии = Неопределено;
		Объект.СуммаКомиссии = 0;
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Объект.ВалютаКомиссии) Тогда
			Объект.ВалютаКомиссии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета");
		КонецЕсли;
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОплатыКомиссииСДатойПриИзменении(Элемент)
	
	ЭтаФорма.ВариантыОплатыКомиссииБезДаты = 0;
	
	Объект.ОтложеннаяОплатаКомиссии = Истина;
	Объект.ДатаОплатыКомиссии       = Макс(Объект.Дата, Объект.ДатаИсполнения);
	
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаКомиссии) Тогда
		Объект.ВалютаКомиссии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета");
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);
	
	НастроитьВидимостьИДоступностьРасчетногоСчетаПолучателяИСвязанныхРеквизитов(ЭтаФорма);
	
	// проверим актуальность р/счета
	РеквизитыИсполнителя = ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, Брокер, РасчетныйСчет");
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель(?(ЭтаФорма.СделкаЧерезБрокера = 1, "ИсполнителиПоДенежнымСредствамБрокерские", "ИсполнителиПоДенежнымСредствамСобственные"), РеквизитыИсполнителя) Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;
	
	// проверим актуальность р/счета контрвалюты
	РеквизитыИсполнителя.РасчетныйСчет = Объект.РасчетныйСчетКонтрвалюты;
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель(?(ЭтаФорма.СделкаЧерезБрокера = 1, "ИсполнителиПоДенежнымСредствамБрокерские", "ИсполнителиПоДенежнымСредствамСобственные"), РеквизитыИсполнителя) Тогда
		Объект.РасчетныйСчетКонтрвалюты = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТипСделкиПриИзменении(Элемент)
	
	Если Объект.ТипСделки <> ПредопределенноеЗначение("Перечисление.ТипыСделокСВалютой.СвопВтораяЧасть")
		И Объект.ТипСделки <> ПредопределенноеЗначение("Перечисление.ТипыСделокСВалютой.Конверсионная") Тогда
		Объект.Основание = Неопределено;
	КонецЕсли;
	
	Если Объект.ТипСделки = ПредопределенноеЗначение("Перечисление.ТипыСделокСВалютой.ФорвардПоставочный") Тогда
		Объект.ОтложенноеИсполнение = Истина;
	КонецЕсли;
	
	УстановитьПараметрыВыбораОснованияПоТипуСделки(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);
	НастроитьВидимостьИДоступностьРасчетногоСчетаПолучателяИСвязанныхРеквизитов(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СделкаЧерезБрокераПриИзменении(Элемент)
	
	Если ЭтаФорма.СделкаЧерезБрокера = 0 Тогда
		Объект.Брокер = Неопределено;
	Иначе
		Объект.НомерПодтверждения = "";
	КонецЕсли;
	
	Элементы.Брокер.Видимость = (ЭтаФорма.СделкаЧерезБрокера = 1);	
	
	ЭтоПрямаяКонверсионнаяСделка = ЭтоПрямаяКонверсионнаяСделкаПИФ(Объект.СчетДоверительногоУправления, ЭтаФорма.СделкаЧерезБрокера, Объект.ТипСделки);
					
	Элементы.НомерПодтверждения.Видимость 					= ЭтоПрямаяКонверсионнаяСделка;
	Элементы.НомерПодтверждения.АвтоОтметкаНезаполненного 	= ЭтоПрямаяКонверсионнаяСделка;
	
	БрокерПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	ПересчетСуммыОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	
	ПересчетСуммыОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
	
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
		
		Если Объект.Валюта <> ВалютаРасчетногоСчета Тогда
		
			Объект.Валюта = ВалютаРасчетногоСчета;
			НастроитьЗаголовки(ЭтаФорма);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетКонтрвалютыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчетКонтрвалюты) Тогда
	
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетКонтрвалюты, "Валюта");
		
		Если Объект.Контрвалюта <> ВалютаРасчетногоСчета Тогда
		
			Объект.Контрвалюта = ВалютаРасчетногоСчета;
			НастроитьЗаголовки(ЭтаФорма);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	НастроитьЗаголовки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрвалютаПриИзменении(Элемент)
	
	НастроитьЗаголовки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.Валюта, Объект.РасчетныйСчет);
		
КонецПроцедуры

&НаКлиенте
Процедура КонтрвалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.Контрвалюта, Объект.РасчетныйСчетКонтрвалюты);
		
КонецПроцедуры

&НаКлиенте
Процедура ОтложенноеИсполнениеПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	
	ЭтоБиржеваяСделка = (Объект.МестоХранения <> ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок"));
	
	Если Не ЭтоБиржеваяСделка Тогда
		Объект.НомерСделки = "";
	КонецЕсли;
	
	Элементы.НомерСделки.Видимость = ЭтоБиржеваяСделка;
	
КонецПроцедуры


#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, ЭтаФорма.СделкаЧерезБрокера);
	РасчетныйСчетПриИзменении(Неопределено);

КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Объект);
	ЭтаФорма.СделкаЧерезБрокера           = ЗначениеЗаполнено(Объект.Брокер);
	
	Если Объект.СуммаКомиссии > 0 Тогда
		
		Если Объект.ОтложеннаяОплатаКомиссии Тогда
			ЭтаФорма.ВариантОплатыКомиссииСДатой = 1;
		Иначе
			ЭтаФорма.ВариантыОплатыКомиссииБезДаты = 2;
		КонецЕсли;
		
		 Если НЕ ЗначениеЗаполнено(Объект.ВалютаКомиссии) Тогда
			Объект.ВалютаКомиссии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета");
		КонецЕсли;
		 
	Иначе
		ЭтаФорма.ВариантыОплатыКомиссииБезДаты = 1;
	КонецЕсли;
	
	УстановитьПараметрыВыбораОснованияПоТипуСделки(ЭтаФорма);
		
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЭтаФорма.ВидСделки = "Купля-продажа";
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммыОплаты()
	
	Объект.СуммаКонтрвалюты = Объект.Сумма * Объект.Курс;
	
КонецПроцедуры //ПересчетСуммы

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступностьРасчетногоСчетаПолучателяИСвязанныхРеквизитов(Форма)
	
	Форма.Элементы.РасчетныйСчетКонтрвалюты.Видимость = Форма.ДетализацияПоРасчетномуСчету;
	
КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы = Форма.Элементы;
	ДанныеОбъекта = Форма.Объект;
	
	Элементы.Основание.Видимость = (Форма.Объект.ТипСделки = ПредопределенноеЗначение("Перечисление.ТипыСделокСВалютой.СвопВтораяЧасть")
										ИЛИ Форма.Объект.ТипСделки = ПредопределенноеЗначение("Перечисление.ТипыСделокСВалютой.Конверсионная"));
	Элементы.Брокер.Видимость = (Форма.СделкаЧерезБрокера = 1);
	
	ЭтоПрямаяКонверсионнаяСделка = ЭтоПрямаяКонверсионнаяСделкаПИФ(Форма.Объект.СчетДоверительногоУправления, Форма.СделкаЧерезБрокера, Форма.Объект.ТипСделки);
	Элементы.НомерПодтверждения.Видимость = ЭтоПрямаяКонверсионнаяСделка;
	Элементы.НомерПодтверждения.АвтоОтметкаНезаполненного = ЭтоПрямаяКонверсионнаяСделка;
	
	ЭтоБиржеваяСделка = (Форма.Объект.МестоХранения <> ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок"));
	Элементы.НомерСделки.Видимость = ЭтоБиржеваяСделка;
		
	Элементы.ГруппаСуммыКомиссии.Видимость  = (Форма.ВариантыОплатыКомиссииБезДаты = 2 Или Форма.ВариантОплатыКомиссииСДатой = 1);
	Элементы.ДатаОплатыКомиссии.Видимость = (Форма.ВариантОплатыКомиссииСДатой = 1);
	Элементы.ДатаИсполнения.Видимость  = Форма.Объект.ОтложенноеИсполнение
											ИЛИ Форма.Объект.ТипСделки = ПредопределенноеЗначение("Перечисление.ТипыСделокСВалютой.ФорвардПоставочный");
	Элементы.ОтложенноеИсполнение.Видимость = Форма.Объект.ТипСделки <> ПредопределенноеЗначение("Перечисление.ТипыСделокСВалютой.ФорвардПоставочный");
	
	// элементы, зависящие от детализации по р/с
	РаботаСДокументамиКлиентСервер.НастроитьВидимостьИДоступностьРасчетногоСчетаИСвязанныхРеквизитов(Форма);
	НастроитьВидимостьИДоступностьРасчетногоСчетаПолучателяИСвязанныхРеквизитов(Форма);

	Элементы.ДекорацияАкцептовано.Видимость = (ЗначениеЗаполнено(ДанныеОбъекта.Ссылка) И РаботаСДокументами.ДокументАкцептован(ДанныеОбъекта.Ссылка, ДанныеОбъекта.Организация));
	
	НастроитьЗаголовки(Форма);
	
КонецПроцедуры // НастроитьВидимостьИДоступность

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыВыбораОснованияПоТипуСделки(Форма)
	
	Если Форма.Объект.ТипСделки = ПредопределенноеЗначение("Перечисление.ТипыСделокСВалютой.Конверсионная") Тогда
		
		МассивПараметровВыбора = Новый Массив;
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ТипСделки", ПредопределенноеЗначение("Перечисление.ТипыСделокСВалютой.ФорвардПоставочный")));
		
		Форма.Элементы.Основание.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
	ИначеЕсли Форма.Объект.ТипСделки = ПредопределенноеЗначение("Перечисление.ТипыСделокСВалютой.СвопВтораяЧасть") Тогда
		
		МассивПараметровВыбора = Новый Массив;
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ТипСделки", ПредопределенноеЗначение("Перечисление.ТипыСделокСВалютой.СвопПерваяЧасть")));
		
		Форма.Элементы.Основание.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЗаголовки(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.Валюта) Тогда
		Элементы.Сумма.Заголовок         = "Валюта, " + Объект.Валюта;
		Элементы.РасчетныйСчет.Заголовок = "Р/счет валюты, " + Объект.Валюта;
	Иначе
		Элементы.Сумма.Заголовок         = "Валюта";
		Элементы.РасчетныйСчет.Заголовок = "Р/счет валюты";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Контрвалюта) Тогда
		Элементы.СуммаКонтрвалюты.Заголовок         = "Контрвалюта, " + Объект.Контрвалюта;
		Элементы.РасчетныйСчетКонтрвалюты.Заголовок = "Р/счет контрвалюты, " + Объект.Контрвалюта;
	Иначе
		Элементы.СуммаКонтрвалюты.Заголовок         = "Контрвалюта";
		Элементы.РасчетныйСчетКонтрвалюты.Заголовок = "Р/счет контрвалюты";
	КонецЕсли;
	
КонецПроцедуры // НастроитьЗаголовки

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоПрямаяКонверсионнаяСделкаПИФ(СчетДоверительногоУправления, СделкаЧерезБрокера, ТипСделки)
	
	Возврат СделкаЧерезБрокера = 0
		И ТипСделки = Перечисления.ТипыСделокСВалютой.Конверсионная
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда;

КонецФункции
	
#КонецОбласти
